<?php
$E=array(3, -2, 5, -7, 8, -4, 6);
$F=array(-1, 2, 4, -6, 7, -3, 9);

// Ініціалізація змінної для зберігання суми додатних елементів
$sum = 0;

// Перевірка кожного елемента масивів і додавання до суми, якщо елемент додатній
for ($i = 0; $i < count($E); $i++) {
    if ($E[$i] > 0) {
        $sum += $E[$i];
    }
}

for ($i = 0; $i < count($F); $i++) {
    if ($F[$i] > 0) {
        $sum += $F[$i];
    }
}

// Виведення результату на екран
echo "Сума додатних елементів масивів E та F: " . $sum;

